app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index

    @all_ratings = Movie.ratings
    @hilite = params[:hilite]
    @ratings_hash = params[:ratings]

    if @ratings_hash.nil?
      @ratings_hash = session[:ratings]
      if @ratings_hash.nil?
        @ratings_hash = Hash.new
        @ratings = @all_ratings
      else
        @ratings = @ratings_hash.keys
      end
    else
      @ratings = @ratings_hash.keys
    end
    if @hilite.nil?
      @hilite = session[:hilite]
    end

    if (@hilite == 'release_date')
      @movies = Movie.find(:all, :conditions =>{:rating => @ratings}, :order => "release_date")